pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                    File 'pic18_build_binary_code.cpp'                     *
//                        Generated by version 2.5.0                         *
//                       july 7th, 2013, at 19h32'22"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_build_binary_code.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*

#include "piccoloDevice_grammar.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_build_binary_code.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTable::cMapElement_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_lstring & inKey,
                                                                                                                const GALGAS_uint & in_mSymbolAddress
                                                                                                                COMMA_LOCATION_ARGS) :
cMapElement (inKey COMMA_THERE),
mAttribute_mSymbolAddress (in_mSymbolAddress) {
}

//---------------------------------------------------------------------------*

bool cMapElement_pic_31__38__5F_intermediate_5F_symbolTable::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mSymbolAddress.isValid () ;
}

//---------------------------------------------------------------------------*

cMapElement * cMapElement_pic_31__38__5F_intermediate_5F_symbolTable::copy (void) {
  cMapElement * result = NULL ;
  macroMyNew (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTable (mAttribute_lkey, mAttribute_mSymbolAddress COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cMapElement_pic_31__38__5F_intermediate_5F_symbolTable::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mSymbolAddress" ":" ;
  mAttribute_mSymbolAddress.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cMapElement_pic_31__38__5F_intermediate_5F_symbolTable::compare (const cCollectionElement * inOperand) const {
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * operand = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) inOperand ;
  typeComparisonResult result = mAttribute_lkey.objectCompare (operand->mAttribute_lkey) ;
  if (kOperandEqual == result) {
    result = mAttribute_mSymbolAddress.objectCompare (operand->mAttribute_mSymbolAddress) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::GALGAS_pic_31__38__5F_intermediate_5F_symbolTable (void) :
AC_GALGAS_map () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::GALGAS_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inSource) :
AC_GALGAS_map (inSource) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::operator = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inSource) {
  * ((AC_GALGAS_map *) this) = inSource ;
  return * this ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::constructor_emptyMap (LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable result ;
  result.makeNewEmptyMap (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::constructor_mapWithMapToOverride (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inMapToOverride
                                                                                                                                       COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable result ;
  result.makeNewEmptyMapWithMapToOverride (inMapToOverride COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::reader_overriddenMap (UNUSED_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable result ;
  getOverridenMap (result) ;
  return result ;
}
//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::modifier_insertKey (GALGAS_lstring inKey,
                                                                            GALGAS_uint inArgument0,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_LOCATION_ARGS) {
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = NULL ;
  macroMyNew (p, cMapElement_pic_31__38__5F_intermediate_5F_symbolTable (inKey, inArgument0 COMMA_HERE)) ;
  capCollectionElement attributes ;
  attributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
  const char * kInsertErrorMessage = "the '%K' label is already declared in %L" ;
  const char * kShadowErrorMessage = "" ;
  performInsert (attributes, inCompiler, kInsertErrorMessage, kShadowErrorMessage COMMA_THERE) ;
}

//---------------------------------------------------------------------------*

const char * kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTable_searchKey = "the '%K' label is not declared" ;

//---------------------------------------------------------------------------*

