pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
void GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::method_searchKey (GALGAS_lstring inKey,
                                                                          GALGAS_uint & outArgument0,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) performSearch (inKey,
                                                                                                                                                       inCompiler,
                                                                                                                                                       kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTable_searchKey
                                                                                                                                                       COMMA_THERE) ;
  if (NULL == p) {
    outArgument0.drop () ;
  }else{
    macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
    outArgument0 = p->mAttribute_mSymbolAddress ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::reader_mSymbolAddressForKey (const GALGAS_string & inKey,
                                                                                            C_Compiler * inCompiler
                                                                                            COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) attributes ;
  GALGAS_uint result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
    result = p->mAttribute_mSymbolAddress ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::modifier_setMSymbolAddressForKey (GALGAS_uint inAttributeValue,
                                                                                          GALGAS_string inKey,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
    p->mAttribute_mSymbolAddress = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                                                      const GALGAS_string & inKey
                                                                                                                                                      COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * result = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) p ;
  macroNullOrValidSharedObject (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
  return result ;
}

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                                                         const GALGAS_lstring & inKey
                                                                                                                                                         COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler, kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTable_searchKey COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * result = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) p ;
  macroNullOrValidSharedObject (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
  return result ;
}

//---------------------------------------------------------------------------*

cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable::cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inEnumeratedObject,
                                                                                                                const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable::current (LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
  return GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (p->mAttribute_lkey, p->mAttribute_mSymbolAddress) ;
}

//---------------------------------------------------------------------------*

