pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
GALGAS_lstring cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable::current_mSymbolAddress (LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTable) ;
  return p->mAttribute_mSymbolAddress ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                   @pic18_intermediate_symbolTable type                    *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable ("pic18_intermediate_symbolTable",
                                                                   NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_symbolTable (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::extractObject (const GALGAS_object & inObject,
                                                                                                                    C_Compiler * inCompiler,
                                                                                                                    const GALGAS_location & inErrorLocation,
                                                                                                                    const GALGAS_string & inErrorMessage
                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable * p = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//               Class for element of '@emittedCodeList' list                *
//                                                                           *
//---------------------------------------------------------------------------*

class cCollectionElement_emittedCodeList : public cCollectionElement {
  public : GALGAS_emittedCodeList_2E_element mObject ;

//--- Constructor
  public : cCollectionElement_emittedCodeList (const GALGAS_uintlist & in_mCode
                                               COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cCollectionElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//---------------------------------------------------------------------------*

cCollectionElement_emittedCodeList::cCollectionElement_emittedCodeList (const GALGAS_uintlist & in_mCode
                                                                        COMMA_LOCATION_ARGS) :
cCollectionElement (THERE),
mObject (in_mCode) {
}

//---------------------------------------------------------------------------*

bool cCollectionElement_emittedCodeList::isValid (void) const {
  return mObject.isValid () ;
}

//---------------------------------------------------------------------------*

cCollectionElement * cCollectionElement_emittedCodeList::copy (void) {
  cCollectionElement * result = NULL ;
  macroMyNew (result, cCollectionElement_emittedCodeList (mObject.mAttribute_mCode COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cCollectionElement_emittedCodeList::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mCode" ":" ;
  mObject.mAttribute_mCode.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cCollectionElement_emittedCodeList::compare (const cCollectionElement * inOperand) const {
  cCollectionElement_emittedCodeList * operand = (cCollectionElement_emittedCodeList *) inOperand ;
  macroValidSharedObject (operand, cCollectionElement_emittedCodeList) ;
  return mObject.objectCompare (operand->mObject) ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList::GALGAS_emittedCodeList (void) :
AC_GALGAS_list () {
}

//---------------------------------------------------------------------------*

