pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
GALGAS_emittedCodeList::GALGAS_emittedCodeList (cSharedList * inSharedListPtr) :
AC_GALGAS_list (inSharedListPtr) {
  if (NULL == inSharedListPtr) {
    createNewEmptyList (HERE) ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList GALGAS_emittedCodeList::constructor_emptyList (LOCATION_ARGS) {
  GALGAS_emittedCodeList result ;
  result.createNewEmptyList (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList GALGAS_emittedCodeList::constructor_listWithValue (const GALGAS_uintlist & inOperand0
                                                                          COMMA_LOCATION_ARGS) {
  GALGAS_emittedCodeList result ;
  if (inOperand0.isValid ()) {
    result.createNewEmptyList (THERE) ;
    capCollectionElement attributes ;
    GALGAS_emittedCodeList::makeAttributesFromObjects (attributes, inOperand0 COMMA_THERE) ;
    result.addObject (attributes) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::makeAttributesFromObjects (capCollectionElement & outAttributes,
                                                        const GALGAS_uintlist & in_mCode
                                                        COMMA_LOCATION_ARGS) {
  cCollectionElement_emittedCodeList * p = NULL ;
  macroMyNew (p, cCollectionElement_emittedCodeList (in_mCode COMMA_THERE)) ;
  outAttributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::addAssign_operation (const GALGAS_uintlist & inOperand0
                                                  COMMA_LOCATION_ARGS) {
  if (isValid () && inOperand0.isValid ()) {
    cCollectionElement * p = NULL ;
    macroMyNew (p, cCollectionElement_emittedCodeList (inOperand0 COMMA_THERE)) ;
    capCollectionElement attributes ;
    attributes.setPointer (p) ;
    macroDetachSharedObject (p) ;
    addObject (attributes) ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::modifier_prependValue (GALGAS_uintlist inOperand0
                                                    COMMA_LOCATION_ARGS) {
  if (isValid () && inOperand0.isValid ()) {
    cCollectionElement * p = NULL ;
    macroMyNew (p, cCollectionElement_emittedCodeList (inOperand0 COMMA_THERE)) ;
    capCollectionElement attributes ;
    attributes.setPointer (p) ;
    macroDetachSharedObject (p) ;
    prependAttributeArray (attributes) ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::modifier_popFirst (GALGAS_uintlist & outOperand0,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  removeFirstObject (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_emittedCodeList * p = (cCollectionElement_emittedCodeList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_emittedCodeList) ;
    outOperand0 = p->mObject.mAttribute_mCode ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::modifier_popLast (GALGAS_uintlist & outOperand0,
                                               C_Compiler * inCompiler
                                               COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  removeLastObject (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_emittedCodeList * p = (cCollectionElement_emittedCodeList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_emittedCodeList) ;
    macroUniqueSharedObject (p) ;
    outOperand0 = p->mObject.mAttribute_mCode ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::method_first (GALGAS_uintlist & outOperand0,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes ;
  readFirst (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_emittedCodeList * p = (cCollectionElement_emittedCodeList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_emittedCodeList) ;
    outOperand0 = p->mObject.mAttribute_mCode ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::method_last (GALGAS_uintlist & outOperand0,
                                          C_Compiler * inCompiler
                                          COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes ;
  readLast (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_emittedCodeList * p = (cCollectionElement_emittedCodeList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_emittedCodeList) ;
    outOperand0 = p->mObject.mAttribute_mCode ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList GALGAS_emittedCodeList::operator_concat (const GALGAS_emittedCodeList & inOperand
                                                                COMMA_UNUSED_LOCATION_ARGS) const {
  GALGAS_emittedCodeList result ;
  if (isValid () && inOperand.isValid ()) {
    result = *this ;
    result.appendList (inOperand) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList GALGAS_emittedCodeList::reader_subListWithRange (const GALGAS_range & inRange,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_LOCATION_ARGS) const {
  GALGAS_emittedCodeList result = GALGAS_emittedCodeList::constructor_emptyList (THERE) ;
  subListWithRange (result, inRange, inCompiler COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList GALGAS_emittedCodeList::reader_subListFromIndex (const GALGAS_uint & inIndex,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_LOCATION_ARGS) const {
  GALGAS_emittedCodeList result = GALGAS_emittedCodeList::constructor_emptyList (THERE) ;
  subListFromIndex (result, inIndex, inCompiler COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList::dotAssign_operation (const GALGAS_emittedCodeList inOperand
                                                  COMMA_UNUSED_LOCATION_ARGS) {
  appendList (inOperand) ;
}

//---------------------------------------------------------------------------*

GALGAS_uintlist GALGAS_emittedCodeList::reader_mCodeAtIndex (const GALGAS_uint & inIndex,
                                                             C_Compiler * inCompiler
                                                             COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes = readObjectAtIndex (inIndex, inCompiler COMMA_THERE) ;
  cCollectionElement_emittedCodeList * p = (cCollectionElement_emittedCodeList *) attributes.ptr () ;
  GALGAS_uintlist result ;
  if (NULL != p) {
    macroValidSharedObject (p, cCollectionElement_emittedCodeList) ;
    result = p->mObject.mAttribute_mCode ;
  }
  return result ;
}



//---------------------------------------------------------------------------*

cEnumerator_emittedCodeList::cEnumerator_emittedCodeList (const GALGAS_emittedCodeList & inEnumeratedObject,
                                                          const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element cEnumerator_emittedCodeList::current (LOCATION_ARGS) const {
  const cCollectionElement_emittedCodeList * p = (const cCollectionElement_emittedCodeList *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cCollectionElement_emittedCodeList) ;
  return p->mObject ;
}


//---------------------------------------------------------------------------*

GALGAS_uintlist cEnumerator_emittedCodeList::current_mCode (LOCATION_ARGS) const {
  const cCollectionElement_emittedCodeList * p = (const cCollectionElement_emittedCodeList *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cCollectionElement_emittedCodeList) ;
  return p->mObject.mAttribute_mCode ;
}




//---------------------------------------------------------------------------*
//                                                                           *
//                           @emittedCodeList type                           *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_emittedCodeList ("emittedCodeList",
                                        NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_emittedCodeList::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_emittedCodeList ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_emittedCodeList::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_emittedCodeList (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

