pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
GALGAS_emittedCodeList GALGAS_emittedCodeList::extractObject (const GALGAS_object & inObject,
                                                              C_Compiler * inCompiler,
                                                              const GALGAS_location & inErrorLocation,
                                                              const GALGAS_string & inErrorMessage
                                                              COMMA_LOCATION_ARGS) {
  GALGAS_emittedCodeList result ;
  const GALGAS_emittedCodeList * p = (const GALGAS_emittedCodeList *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_emittedCodeList *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                         Routine 'getBccBaseCode'                          *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getBccBaseCode (const GALGAS_conditional_5F_branch constinArgument_inConditionalBranch,
                             GALGAS_uint & outArgument_outBaseCode,
                             C_Compiler * /* inCompiler */
                             COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outBaseCode.drop () ; // Release 'out' argument
  if (constinArgument_inConditionalBranch.isValid ()) {
    switch (constinArgument_inConditionalBranch.enumValue ()) {
    case GALGAS_conditional_5F_branch::kNotBuilt:
      break ;
    case GALGAS_conditional_5F_branch::kEnum_bz: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 57344U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnz: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 57600U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bn: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 58880U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnn: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 59136U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bc: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 57856U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnc: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 58112U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bov: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 58368U) ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnov: {
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 58624U) ;
      } break ;
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                Routine 'emitConditionalBranchInstruction'                 *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitConditionalBranchInstruction (const GALGAS_uint constinArgument_inConditionalBranchInstructionAddress,
                                               const GALGAS_uint constinArgument_inTargetAddress,
                                               const GALGAS_location constinArgument_inErrorLocation,
                                               const GALGAS_conditional_5F_branch constinArgument_inConditionalBranch,
                                               GALGAS_emittedCodeList & ioArgument_ioCode,
                                               C_Compiler * inCompiler
                                               COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_sint var_displacement = constinArgument_inTargetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (232)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (232)).substract_operation (constinArgument_inConditionalBranchInstructionAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (232)), inCompiler COMMA_SOURCE_FILE_AT_LINE (232)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (232)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 127L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 128L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (233)))) COMMA_SOURCE_FILE_AT_LINE (233)).boolEnum () ;
  if (kBoolTrue == test_0) {
    inCompiler->emitSemanticError (constinArgument_inErrorLocation, GALGAS_string ("displacement too large for conditional branch instruction") COMMA_SOURCE_FILE_AT_LINE (234)) ;
  }
  GALGAS_uint var_baseCode ;
  {
  routine_getBccBaseCode (constinArgument_inConditionalBranch, var_baseCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (238)) ;
  }
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_baseCode.operator_or (var_displacement.operator_and (GALGAS_sint ((PMSInt32) 255L) COMMA_SOURCE_FILE_AT_LINE (239)).reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (239)) COMMA_SOURCE_FILE_AT_LINE (239)) COMMA_SOURCE_FILE_AT_LINE (239)) COMMA_SOURCE_FILE_AT_LINE (239)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                       Routine 'emitBRAinstruction'                        *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitBRAinstruction (const GALGAS_uint constinArgument_inBRAinstructionAddress,
                                 const GALGAS_uint constinArgument_inTargetAddress,
                                 const GALGAS_location constinArgument_inErrorLocation,
                                 GALGAS_emittedCodeList & ioArgument_ioCode,
                                 C_Compiler * inCompiler
                                 COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_sint var_displacement = constinArgument_inTargetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (250)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (250)).substract_operation (constinArgument_inBRAinstructionAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (250)), inCompiler COMMA_SOURCE_FILE_AT_LINE (250)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (250)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (251)))) COMMA_SOURCE_FILE_AT_LINE (251)).boolEnum () ;
  if (kBoolTrue == test_0) {
    inCompiler->emitSemanticError (constinArgument_inErrorLocation, GALGAS_string ("displacement too large for BRA instruction") COMMA_SOURCE_FILE_AT_LINE (252)) ;
  }
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 53248U).operator_or (var_displacement.operator_and (GALGAS_sint ((PMSInt32) 2047L) COMMA_SOURCE_FILE_AT_LINE (255)).reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (255)) COMMA_SOURCE_FILE_AT_LINE (255)) COMMA_SOURCE_FILE_AT_LINE (255)) COMMA_SOURCE_FILE_AT_LINE (255)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'emit_pic18_GOTOinstruction'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emit_5F_pic_31__38__5F_GOTOinstruction (const GALGAS_uint constinArgument_inTargetAddress,
                                                     GALGAS_emittedCodeList & ioArgument_ioCode,
                                                     C_Compiler * /* inCompiler */
                                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uintlist var_code = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (264)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 61184U).operator_or (constinArgument_inTargetAddress.right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (265)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (265)) COMMA_SOURCE_FILE_AT_LINE (265)) COMMA_SOURCE_FILE_AT_LINE (265)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 61440U).operator_or (constinArgument_inTargetAddress.right_shift_operation (GALGAS_uint ((PMUInt32) 9U) COMMA_SOURCE_FILE_AT_LINE (266)) COMMA_SOURCE_FILE_AT_LINE (266)) COMMA_SOURCE_FILE_AT_LINE (266)) ;
  ioArgument_ioCode.addAssign_operation (var_code COMMA_SOURCE_FILE_AT_LINE (267)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'emit_pic18_CALLinstruction'                    *
//                                                                           *
//---------------------------------------------------------------------------*

