pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
void routine_emit_5F_pic_31__38__5F_CALLinstruction (const GALGAS_uint constinArgument_inTargetAddress,
                                                     GALGAS_emittedCodeList & ioArgument_ioCode,
                                                     C_Compiler * /* inCompiler */
                                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uintlist var_code = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (357)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 60416U).operator_or (constinArgument_inTargetAddress.right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (358)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (358)) COMMA_SOURCE_FILE_AT_LINE (358)) COMMA_SOURCE_FILE_AT_LINE (358)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 61440U).operator_or (constinArgument_inTargetAddress.right_shift_operation (GALGAS_uint ((PMUInt32) 9U) COMMA_SOURCE_FILE_AT_LINE (359)) COMMA_SOURCE_FILE_AT_LINE (359)) COMMA_SOURCE_FILE_AT_LINE (359)) ;
  ioArgument_ioCode.addAssign_operation (var_code COMMA_SOURCE_FILE_AT_LINE (360)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'emitRCALLinstruction'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitRCALLinstruction (const GALGAS_uint constinArgument_inRCALLinstructionAddress,
                                   const GALGAS_uint constinArgument_inTargetAddress,
                                   const GALGAS_lstring constinArgument_inTargetLabel,
                                   GALGAS_emittedCodeList & ioArgument_ioCode,
                                   C_Compiler * inCompiler
                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_sint var_displacement = constinArgument_inTargetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (371)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (371)).substract_operation (constinArgument_inRCALLinstructionAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (371)), inCompiler COMMA_SOURCE_FILE_AT_LINE (371)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (371)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (372)))) COMMA_SOURCE_FILE_AT_LINE (372)).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_location location_1 (constinArgument_inTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_1, GALGAS_string ("displacement too large (").operator_concat (var_displacement.reader_string (SOURCE_FILE_AT_LINE (373)) COMMA_SOURCE_FILE_AT_LINE (373)).operator_concat (GALGAS_string (") for RCALL instruction to '") COMMA_SOURCE_FILE_AT_LINE (374)).operator_concat (constinArgument_inTargetLabel.reader_string (SOURCE_FILE_AT_LINE (374)) COMMA_SOURCE_FILE_AT_LINE (374)).operator_concat (GALGAS_string ("' (should be between -1024 and 1023)") COMMA_SOURCE_FILE_AT_LINE (374)) COMMA_SOURCE_FILE_AT_LINE (373)) ;
  }
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 55296U).operator_or (var_displacement.operator_and (GALGAS_sint ((PMSInt32) 2047L) COMMA_SOURCE_FILE_AT_LINE (377)).reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (377)) COMMA_SOURCE_FILE_AT_LINE (377)) COMMA_SOURCE_FILE_AT_LINE (377)) COMMA_SOURCE_FILE_AT_LINE (377)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//              Routine 'build_pic18_intermediate_binary_code'               *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_build_5F_pic_31__38__5F_intermediate_5F_binary_5F_code (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                                     const GALGAS_uint constinArgument_inROMsize,
                                                                     const GALGAS_actualConfigurationMap constinArgument_inActualConfigurationMap,
                                                                     GALGAS_uint & outArgument_outUsedROMsize,
                                                                     C_Compiler * inCompiler
                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outUsedROMsize.drop () ; // Release 'out' argument
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable var_symbolTable = GALGAS_pic_31__38__5F_intermediate_5F_symbolTable::constructor_emptyMap (SOURCE_FILE_AT_LINE (883)) ;
  GALGAS_uint var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_30266 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
  while (enumerator_30266.hasCurrentObject ()) {
    callCategoryMethod_enterLabelAtAddress ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_30266.current_mInstruction (HERE).ptr (), var_symbolTable, var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (886)) ;
    enumerator_30266.gotoNextObject () ;
  }
  GALGAS_uint var_lastAddressForFirstPass = var_currentAddress ;
  outArgument_outUsedROMsize = var_currentAddress ;
  var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
  {
  routine_setEmitAddress (GALGAS_uint ((PMUInt32) 0U), inCompiler COMMA_SOURCE_FILE_AT_LINE (892)) ;
  }
  cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_30590 (constinArgument_inGeneratedInstructionList, kEnumeration_up) ;
  while (enumerator_30590.hasCurrentObject ()) {
    GALGAS_emittedCodeList var_code = GALGAS_emittedCodeList::constructor_emptyList (SOURCE_FILE_AT_LINE (894)) ;
    GALGAS_uint var_startAddress = var_currentAddress ;
    callCategoryMethod_generateBinaryCodeAtAddress ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_30590.current_mInstruction (HERE).ptr (), var_symbolTable, var_currentAddress, var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (896)) ;
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_startAddress.objectCompare (var_currentAddress)).boolEnum () ;
    if (kBoolTrue == test_0) {
      {
      routine_setEmitAddress (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (898)) ;
      }
    }
    cEnumerator_emittedCodeList enumerator_30880 (var_code, kEnumeration_up) ;
    while (enumerator_30880.hasCurrentObject ()) {
      cEnumerator_uintlist enumerator_30903 (enumerator_30880.current_mCode (HERE), kEnumeration_up) ;
      while (enumerator_30903.hasCurrentObject ()) {
        {
        routine_emitCode (enumerator_30903.current_mValue (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (902)) ;
        }
        enumerator_30903.gotoNextObject () ;
      }
      enumerator_30880.gotoNextObject () ;
    }
    var_currentAddress = var_currentAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_30590.current_mInstruction (HERE).ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (905)), inCompiler COMMA_SOURCE_FILE_AT_LINE (905)) ;
    {
    routine_checkCurrentEmitAddress (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (906)) ;
    }
    enumerator_30590.gotoNextObject () ;
  }
  const enumGalgasBool test_1 = GALGAS_bool (kIsNotEqual, var_lastAddressForFirstPass.objectCompare (var_currentAddress)).boolEnum () ;
  if (kBoolTrue == test_1) {
    inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("Internal second pass error: the last address gets ").operator_concat (var_currentAddress.reader_hexString (SOURCE_FILE_AT_LINE (909)) COMMA_SOURCE_FILE_AT_LINE (909)).operator_concat (GALGAS_string (" value in second pass, while it gets ") COMMA_SOURCE_FILE_AT_LINE (910)).operator_concat (var_lastAddressForFirstPass.reader_hexString (SOURCE_FILE_AT_LINE (911)) COMMA_SOURCE_FILE_AT_LINE (911)).operator_concat (GALGAS_string (" value in first pass") COMMA_SOURCE_FILE_AT_LINE (911)) COMMA_SOURCE_FILE_AT_LINE (909)) ;
  }else if (kBoolFalse == test_1) {
    const enumGalgasBool test_2 = GALGAS_bool (kIsStrictSup, var_lastAddressForFirstPass.objectCompare (constinArgument_inROMsize)).boolEnum () ;
    if (kBoolTrue == test_2) {
      inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("Program too large: ").operator_concat (var_lastAddressForFirstPass.reader_string (SOURCE_FILE_AT_LINE (913)) COMMA_SOURCE_FILE_AT_LINE (913)).operator_concat (GALGAS_string (" bytes (rom size is ") COMMA_SOURCE_FILE_AT_LINE (914)).operator_concat (constinArgument_inROMsize.reader_string (SOURCE_FILE_AT_LINE (915)) COMMA_SOURCE_FILE_AT_LINE (915)).operator_concat (GALGAS_string (" bytes)") COMMA_SOURCE_FILE_AT_LINE (915)) COMMA_SOURCE_FILE_AT_LINE (913)) ;
    }
  }
  cEnumerator_actualConfigurationMap enumerator_31661 (constinArgument_inActualConfigurationMap, kEnumeration_up) ;
  while (enumerator_31661.hasCurrentObject ()) {
    {
    routine_setEmitAddress (enumerator_31661.current_mRegisterAddress (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (919)) ;
    }
    {
    routine_emitByte (enumerator_31661.current_mRegisterValue (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (920)) ;
    }
    enumerator_31661.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//   Category method '@pic18_intermediate_instruction enterLabelAtAddress'   *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterLabelAtAddress (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                             GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & io_ioRoutineSymbolTable,
                                             GALGAS_uint & io_ioAddress,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioRoutineSymbolTable, io_ioAddress, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                           GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & /* ioArgument_ioRoutineSymbolTable */,
                                                                                           GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                           C_Compiler * /* inCompiler */
                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (void) {
  enterCategoryMethod_enterLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress.free () ;
}

//---------------------------------------------------------------------------*

