pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress,
                                                                                           freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_LABEL enterLabelAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                               GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & ioArgument_ioRoutineSymbolTable,
                                                                                               GALGAS_uint & ioArgument_ioAddress,
                                                                                               C_Compiler * inCompiler
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  {
  ioArgument_ioRoutineSymbolTable.modifier_insertKey (object->mAttribute_mLabel, ioArgument_ioAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (32)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_enterLabelAtAddress (void) {
  enterCategoryMethod_enterLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_enterLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_enterLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_enterLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_ORG enterLabelAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                             GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & /* ioArgument_ioRoutineSymbolTable */,
                                                                                             GALGAS_uint & ioArgument_ioAddress,
                                                                                             C_Compiler * /* inCompiler */
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  ioArgument_ioAddress = object->mAttribute_mOrigin ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_enterLabelAtAddress (void) {
  enterCategoryMethod_enterLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_enterLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_enterLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_enterLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_actualInstruction enterLabelAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                 GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & /* ioArgument_ioRoutineSymbolTable */,
                                                                                                 GALGAS_uint & ioArgument_ioAddress,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * object = (const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction) ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction temp_0 = object ;
  ioArgument_ioAddress = ioArgument_ioAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) temp_0.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (51)), inCompiler COMMA_SOURCE_FILE_AT_LINE (51)) ;
}
//---------------------------------------------------------------------------*

