pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_enterLabelAtAddress (void) {
  enterCategoryMethod_enterLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_enterLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_actualInstruction_enterLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_enterLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_word enterLabelAtAddress' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                    GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & /* ioArgument_ioRoutineSymbolTable */,
                                                                                    GALGAS_uint & ioArgument_ioAddress,
                                                                                    C_Compiler * inCompiler
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_word * object = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_word temp_0 = object ;
  ioArgument_ioAddress = ioArgument_ioAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_word *) temp_0.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (60)), inCompiler COMMA_SOURCE_FILE_AT_LINE (60)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_enterLabelAtAddress (void) {
  enterCategoryMethod_enterLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_word_enterLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_enterLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_enterLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_generateBinaryCodeAtAddress (const PMSInt32 inClassIndex,
                                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress (NULL,
                                                                                                   freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                     const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constin_inRoutineSymbolTable,
                                                     GALGAS_uint & io_ioAddress,
                                                     GALGAS_emittedCodeList & io_ioCode,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inRoutineSymbolTable, io_ioAddress, io_ioCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_NULL generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

