pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_NULL_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                            GALGAS_emittedCodeList & /* ioArgument_ioCode */,
                                                                                            C_Compiler * /* inCompiler */
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_NULL_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_NULL_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_ORG generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                     const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                     GALGAS_uint & ioArgument_ioAddress,
                                                                                                     GALGAS_emittedCodeList & /* ioArgument_ioCode */,
                                                                                                     C_Compiler * /* inCompiler */
                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  ioArgument_ioAddress = object->mAttribute_mOrigin ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_word generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                            C_Compiler * /* inCompiler */
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_word * object = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (object->mAttribute_mValue COMMA_SOURCE_FILE_AT_LINE (109)) COMMA_SOURCE_FILE_AT_LINE (109)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_word_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

