pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_MOV_LABEL_W generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                         GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                         GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W * object = (const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W) ;
  GALGAS_uint var_address ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mLabel, var_address, inCompiler COMMA_SOURCE_FILE_AT_LINE (120)) ;
  GALGAS_uint var_code = var_address.add_operation (object->mAttribute_mOffset, inCompiler COMMA_SOURCE_FILE_AT_LINE (121)).right_shift_operation (object->mAttribute_mRightShift COMMA_SOURCE_FILE_AT_LINE (121)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (121)) ;
  GALGAS_uint var_code_5F_MOVLW = GALGAS_uint ((PMUInt32) 3584U) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code.operator_or (var_code_5F_MOVLW COMMA_SOURCE_FILE_AT_LINE (123)) COMMA_SOURCE_FILE_AT_LINE (123)) COMMA_SOURCE_FILE_AT_LINE (123)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_FDA generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                          GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                          GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                          C_Compiler * inCompiler
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
  GALGAS_uint var_code ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA temp_0 = object ;
  callCategoryMethod_getBaseCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) temp_0.ptr (), var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (134)) ;
  const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (135)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (136)) ;
  }
  const enumGalgasBool test_2 = object->mAttribute_m_5F_W_5F_isDestination.operator_not (SOURCE_FILE_AT_LINE (138)).boolEnum () ;
  if (kBoolTrue == test_2) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 512U) COMMA_SOURCE_FILE_AT_LINE (139)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (141)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (141)) COMMA_SOURCE_FILE_AT_LINE (141)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (142)) COMMA_SOURCE_FILE_AT_LINE (142)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

