pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_FA generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                         GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                         GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
  GALGAS_uint var_code ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA temp_0 = object ;
  callCategoryMethod_getBaseCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA *) temp_0.ptr (), var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (153)) ;
  const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (154)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (155)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (157)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (157)) COMMA_SOURCE_FILE_AT_LINE (157)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (158)) COMMA_SOURCE_FILE_AT_LINE (158)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVFF generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF) ;
  GALGAS_uintlist var_code = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (168)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 49152U).operator_or (object->mAttribute_mSourceRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (169)) COMMA_SOURCE_FILE_AT_LINE (169)) COMMA_SOURCE_FILE_AT_LINE (169)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 61440U).operator_or (object->mAttribute_mDestinationRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (170)) COMMA_SOURCE_FILE_AT_LINE (170)) COMMA_SOURCE_FILE_AT_LINE (170)) ;
  ioArgument_ioCode.addAssign_operation (var_code COMMA_SOURCE_FILE_AT_LINE (171)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_FBA generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

