pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                          GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                          GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                          C_Compiler * inCompiler
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA) ;
  GALGAS_uint var_code ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA temp_0 = object ;
  callCategoryMethod_getBaseCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) temp_0.ptr (), var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (182)) ;
  const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (183)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (184)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (186)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (186)) COMMA_SOURCE_FILE_AT_LINE (186)) ;
  var_code = var_code.operator_or (object->mAttribute_mBitNumber.left_shift_operation (GALGAS_uint ((PMUInt32) 9U) COMMA_SOURCE_FILE_AT_LINE (187)) COMMA_SOURCE_FILE_AT_LINE (187)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (188)) COMMA_SOURCE_FILE_AT_LINE (188)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_BitTestSkip generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                  const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                                  GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                                  GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                  C_Compiler * inCompiler
                                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
  GALGAS_uint var_code ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip temp_0 = object ;
  callCategoryMethod_getBaseCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) temp_0.ptr (), var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (199)) ;
  const enumGalgasBool test_1 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (200)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (201)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (203)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (203)) COMMA_SOURCE_FILE_AT_LINE (203)) ;
  var_code = var_code.operator_or (object->mAttribute_mBitNumber.left_shift_operation (GALGAS_uint ((PMUInt32) 9U) COMMA_SOURCE_FILE_AT_LINE (204)) COMMA_SOURCE_FILE_AT_LINE (204)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (205)) COMMA_SOURCE_FILE_AT_LINE (205)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

