pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                        GALGAS_uint & ioArgument_ioAddress,
                                                                                                                        GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                        C_Compiler * inCompiler
                                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (278)) ;
  if (object->mAttribute_mBranchMode.isValid ()) {
    switch (object->mAttribute_mBranchMode.enumValue ()) {
    case GALGAS_condionalBranchMode::kNotBuilt:
      break ;
    case GALGAS_condionalBranchMode::kEnum_native: case GALGAS_condionalBranchMode::kEnum_ipicNative: {
      {
      routine_emitConditionalBranchInstruction (ioArgument_ioAddress, var_targetAddress, object->mAttribute_mTargetLabel.reader_location (SOURCE_FILE_AT_LINE (285)), object->mAttribute_mConditionalBranch, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (282)) ;
      }
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicBRA: {
      GALGAS_conditional_5F_branch var_complementary ;
      {
      routine_getComplementaryBcc (object->mAttribute_mConditionalBranch, var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (291)) ;
      }
      {
      routine_emitConditionalBranchInstruction (ioArgument_ioAddress, ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (294)), object->mAttribute_mTargetLabel.reader_location (SOURCE_FILE_AT_LINE (295)), var_complementary, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (292)) ;
      }
      {
      routine_emitBRAinstruction (ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (300)), var_targetAddress, object->mAttribute_mTargetLabel.reader_location (SOURCE_FILE_AT_LINE (302)), ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (299)) ;
      }
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicGOTO: {
      GALGAS_conditional_5F_branch var_complementary ;
      {
      routine_getComplementaryBcc (object->mAttribute_mConditionalBranch, var_complementary, inCompiler COMMA_SOURCE_FILE_AT_LINE (307)) ;
      }
      {
      routine_emitConditionalBranchInstruction (ioArgument_ioAddress, ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 6U), inCompiler COMMA_SOURCE_FILE_AT_LINE (310)), object->mAttribute_mTargetLabel.reader_location (SOURCE_FILE_AT_LINE (311)), var_complementary, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (308)) ;
      }
      {
      routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (315)) ;
      }
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_JUMP generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                            GALGAS_uint & ioArgument_ioAddress,
                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                            C_Compiler * inCompiler
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (330)) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: case GALGAS_jumpInstructionKind::kEnum_relative: {
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (333)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (333)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (333)), inCompiler COMMA_SOURCE_FILE_AT_LINE (333)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (333)) ;
      const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 2048L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 2048L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (334)))) COMMA_SOURCE_FILE_AT_LINE (334)).boolEnum () ;
      if (kBoolTrue == test_0) {
        GALGAS_location location_1 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_1, GALGAS_string ("displacement too large for RCALL instruction") COMMA_SOURCE_FILE_AT_LINE (335)) ;
      }
      {
      routine_emitBRAinstruction (ioArgument_ioAddress, var_targetAddress, object->mAttribute_mTargetLabel.reader_location (SOURCE_FILE_AT_LINE (340)), ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (337)) ;
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: case GALGAS_jumpInstructionKind::kEnum_absolute: {
      {
      routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (344)) ;
      }
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_JSR generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                           const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                           GALGAS_uint & ioArgument_ioAddress,
                                                                                           GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                           C_Compiler * inCompiler
                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (388)) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: case GALGAS_jumpInstructionKind::kEnum_relative: {
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (391)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (391)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (391)), inCompiler COMMA_SOURCE_FILE_AT_LINE (391)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (391)) ;
      const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 2048L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 2048L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (392)))) COMMA_SOURCE_FILE_AT_LINE (392)).boolEnum () ;
      if (kBoolTrue == test_0) {
        GALGAS_location location_1 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_1, GALGAS_string ("displacement too large for RCALL instruction") COMMA_SOURCE_FILE_AT_LINE (393)) ;
      }
      {
      routine_emitRCALLinstruction (ioArgument_ioAddress, var_targetAddress, object->mAttribute_mTargetLabel, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (395)) ;
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: case GALGAS_jumpInstructionKind::kEnum_absolute: {
      {
      routine_emit_5F_pic_31__38__5F_CALLinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (402)) ;
      }
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_JSR_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                                GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                                GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                C_Compiler * /* inCompiler */
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * object = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  GALGAS_uint var_code = GALGAS_uint ((PMUInt32) 26112U) ;
  const enumGalgasBool test_0 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (419)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (420)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (422)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (422)) COMMA_SOURCE_FILE_AT_LINE (422)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (423)) COMMA_SOURCE_FILE_AT_LINE (423)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

