pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                 const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                 GALGAS_uint & ioArgument_ioAddress,
                                                                                                                 GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                 C_Compiler * inCompiler
                                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  GALGAS_uint var_code ;
  const enumGalgasBool test_0 = object->mAttribute_mBranchIfZero.operator_and (object->mAttribute_mIncrement COMMA_SOURCE_FILE_AT_LINE (462)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_code = GALGAS_uint ((PMUInt32) 18432U) ;
  }else if (kBoolFalse == test_0) {
    const enumGalgasBool test_1 = object->mAttribute_mBranchIfZero.operator_and (object->mAttribute_mIncrement.operator_not (SOURCE_FILE_AT_LINE (464)) COMMA_SOURCE_FILE_AT_LINE (464)).boolEnum () ;
    if (kBoolTrue == test_1) {
      var_code = GALGAS_uint ((PMUInt32) 19456U) ;
    }else if (kBoolFalse == test_1) {
      const enumGalgasBool test_2 = object->mAttribute_mBranchIfZero.operator_not (SOURCE_FILE_AT_LINE (466)).operator_and (object->mAttribute_mIncrement COMMA_SOURCE_FILE_AT_LINE (466)).boolEnum () ;
      if (kBoolTrue == test_2) {
        var_code = GALGAS_uint ((PMUInt32) 15360U) ;
      }else if (kBoolFalse == test_2) {
        var_code = GALGAS_uint ((PMUInt32) 11264U) ;
      }
    }
  }
  const enumGalgasBool test_3 = object->mAttribute_m_5F_W_5F_isDestination.operator_not (SOURCE_FILE_AT_LINE (471)).boolEnum () ;
  if (kBoolTrue == test_3) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 512U) COMMA_SOURCE_FILE_AT_LINE (472)) ;
  }
  const enumGalgasBool test_4 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (474)).boolEnum () ;
  if (kBoolTrue == test_4) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (475)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (477)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (477)) COMMA_SOURCE_FILE_AT_LINE (477)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (478)) COMMA_SOURCE_FILE_AT_LINE (478)) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (481)) ;
  const enumGalgasBool test_5 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_5) {
    {
    routine_emitBRAinstruction (ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (483)), var_targetAddress, object->mAttribute_mInstructionLocation, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (483)) ;
    }
  }else if (kBoolFalse == test_5) {
    {
    routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (485)) ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                   const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                   GALGAS_uint & ioArgument_ioAddress,
                                                                                                                   GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                   C_Compiler * inCompiler
                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  GALGAS_uint var_code ;
  if (object->mAttribute_mComparison.isValid ()) {
    switch (object->mAttribute_mComparison.enumValue ()) {
    case GALGAS_registerComparison::kNotBuilt:
      break ;
    case GALGAS_registerComparison::kEnum_notEqual: {
      var_code = GALGAS_uint ((PMUInt32) 25088U) ;
      } break ;
    case GALGAS_registerComparison::kEnum_equal: {
      var_code = GALGAS_uint ((PMUInt32) 25088U) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greaterOrEqual: {
      var_code = GALGAS_uint ((PMUInt32) 24576U) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greater: {
      var_code = GALGAS_uint ((PMUInt32) 25600U) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lowerOrEqual: {
      var_code = GALGAS_uint ((PMUInt32) 25600U) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lower: {
      var_code = GALGAS_uint ((PMUInt32) 24576U) ;
      } break ;
    }
  }
  const enumGalgasBool test_0 = object->mAttribute_mRegisterDescription.reader_mNeedsBSR (SOURCE_FILE_AT_LINE (506)).boolEnum () ;
  if (kBoolTrue == test_0) {
    var_code = var_code.operator_or (GALGAS_uint ((PMUInt32) 256U) COMMA_SOURCE_FILE_AT_LINE (507)) ;
  }
  var_code = var_code.operator_or (object->mAttribute_mRegisterDescription.reader_mRegisterAddress (SOURCE_FILE_AT_LINE (509)).operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (509)) COMMA_SOURCE_FILE_AT_LINE (509)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (510)) COMMA_SOURCE_FILE_AT_LINE (510)) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (513)) ;
  GALGAS_bool var_usesIntermediateBRA ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition temp_1 = object ;
  callCategoryMethod_usesIntermediateBRA ((const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) temp_1.ptr (), var_usesIntermediateBRA, inCompiler COMMA_SOURCE_FILE_AT_LINE (514)) ;
  const enumGalgasBool test_2 = var_usesIntermediateBRA.boolEnum () ;
  if (kBoolTrue == test_2) {
    GALGAS_uint var_intermediateTargetAddress ;
    const enumGalgasBool test_3 = object->mAttribute_mUsesBra.boolEnum () ;
    if (kBoolTrue == test_3) {
      var_intermediateTargetAddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 6U), inCompiler COMMA_SOURCE_FILE_AT_LINE (518)) ;
    }else if (kBoolFalse == test_3) {
      var_intermediateTargetAddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 8U), inCompiler COMMA_SOURCE_FILE_AT_LINE (520)) ;
    }
    {
    routine_emitBRAinstruction (ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (523)), var_intermediateTargetAddress, object->mAttribute_mInstructionLocation, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (522)) ;
    }
    const enumGalgasBool test_4 = object->mAttribute_mUsesBra.boolEnum () ;
    if (kBoolTrue == test_4) {
      {
      routine_emitBRAinstruction (ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (529)), var_targetAddress, object->mAttribute_mInstructionLocation, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (529)) ;
      }
    }else if (kBoolFalse == test_4) {
      {
      routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (531)) ;
      }
    }
  }else if (kBoolFalse == test_2) {
    const enumGalgasBool test_5 = object->mAttribute_mUsesBra.boolEnum () ;
    if (kBoolTrue == test_5) {
      {
      routine_emitBRAinstruction (ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (535)), var_targetAddress, object->mAttribute_mInstructionLocation, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (535)) ;
      }
    }else if (kBoolFalse == test_5) {
      {
      routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (537)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

