pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_CLRWDT generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                             GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                             GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                             C_Compiler * /* inCompiler */
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 4U) COMMA_SOURCE_FILE_AT_LINE (549)) COMMA_SOURCE_FILE_AT_LINE (549)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_DAW generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                          GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                          GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                          C_Compiler * /* inCompiler */
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 7U) COMMA_SOURCE_FILE_AT_LINE (559)) COMMA_SOURCE_FILE_AT_LINE (559)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_DAW.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_NOP generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                          GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                          GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                          C_Compiler * /* inCompiler */
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 0U) COMMA_SOURCE_FILE_AT_LINE (569)) COMMA_SOURCE_FILE_AT_LINE (569)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_NOP.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_POP generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                          const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                          GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                          GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                          C_Compiler * /* inCompiler */
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 6U) COMMA_SOURCE_FILE_AT_LINE (579)) COMMA_SOURCE_FILE_AT_LINE (579)) ;
}
//---------------------------------------------------------------------------*

