pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_POP.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_PUSH generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                           const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                           GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                           GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                           C_Compiler * /* inCompiler */
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 5U) COMMA_SOURCE_FILE_AT_LINE (589)) COMMA_SOURCE_FILE_AT_LINE (589)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RESET generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (599)) COMMA_SOURCE_FILE_AT_LINE (599)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                             GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                             GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                             C_Compiler * /* inCompiler */
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 18U) COMMA_SOURCE_FILE_AT_LINE (609)) COMMA_SOURCE_FILE_AT_LINE (609)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                                   const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                                                   GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                                                   GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                                   C_Compiler * /* inCompiler */
                                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 18U) COMMA_SOURCE_FILE_AT_LINE (619)) COMMA_SOURCE_FILE_AT_LINE (619)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETFIE generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                             GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                             GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                             C_Compiler * /* inCompiler */
                                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE) ;
  GALGAS_uint var_code ;
  const enumGalgasBool test_0 = object->mAttribute_mFastReturn.boolEnum () ;
  if (kBoolTrue == test_0) {
    var_code = GALGAS_uint ((PMUInt32) 17U) ;
  }else if (kBoolFalse == test_0) {
    var_code = GALGAS_uint ((PMUInt32) 16U) ;
  }
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (636)) COMMA_SOURCE_FILE_AT_LINE (636)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_SLEEP generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 3U) COMMA_SOURCE_FILE_AT_LINE (646)) COMMA_SOURCE_FILE_AT_LINE (646)) ;
}
//---------------------------------------------------------------------------*

