pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_literalOperation generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                       const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                                       GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                                       GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                       C_Compiler * inCompiler
                                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  GALGAS_uint var_code ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation temp_0 = object ;
  callCategoryMethod_getBaseCode ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) temp_0.ptr (), var_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (657)) ;
  var_code = var_code.operator_or (object->mAttribute_mLiteralValue COMMA_SOURCE_FILE_AT_LINE (658)) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (var_code COMMA_SOURCE_FILE_AT_LINE (659)) COMMA_SOURCE_FILE_AT_LINE (659)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETLW generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 3072U).operator_or (object->mAttribute_mLiteralValue COMMA_SOURCE_FILE_AT_LINE (670)) COMMA_SOURCE_FILE_AT_LINE (670)) COMMA_SOURCE_FILE_AT_LINE (670)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_LFSR generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                           const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                           GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                           GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                           C_Compiler * /* inCompiler */
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR) ;
  GALGAS_uintlist var_code = GALGAS_uintlist::constructor_emptyList (SOURCE_FILE_AT_LINE (680)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 60928U).operator_or (object->mAttribute_mFSRindex.reader_uint (SOURCE_FILE_AT_LINE (681)).left_shift_operation (GALGAS_uint ((PMUInt32) 4U) COMMA_SOURCE_FILE_AT_LINE (681)) COMMA_SOURCE_FILE_AT_LINE (681)).operator_or (object->mAttribute_mValue.right_shift_operation (GALGAS_uint ((PMUInt32) 8U) COMMA_SOURCE_FILE_AT_LINE (681)) COMMA_SOURCE_FILE_AT_LINE (681)) COMMA_SOURCE_FILE_AT_LINE (681)) ;
  var_code.addAssign_operation (GALGAS_uint ((PMUInt32) 61440U).operator_or (object->mAttribute_mValue.operator_and (GALGAS_uint ((PMUInt32) 255U) COMMA_SOURCE_FILE_AT_LINE (682)) COMMA_SOURCE_FILE_AT_LINE (682)) COMMA_SOURCE_FILE_AT_LINE (682)) ;
  ioArgument_ioCode.addAssign_operation (var_code COMMA_SOURCE_FILE_AT_LINE (683)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVLB generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB) ;
  ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 256U).operator_or (object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (693)) COMMA_SOURCE_FILE_AT_LINE (693)) COMMA_SOURCE_FILE_AT_LINE (693)) COMMA_SOURCE_FILE_AT_LINE (693)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

