pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_LABEL generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                       const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                       GALGAS_uint & ioArgument_ioAddress,
                                                                                                       GALGAS_emittedCodeList & /* ioArgument_ioCode */,
                                                                                                       C_Compiler * inCompiler
                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (704)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_targetAddress.objectCompare (ioArgument_ioAddress)).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_location location_1 (object->mAttribute_mLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_1, GALGAS_string ("Internal second pass error: the '").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (706)) COMMA_SOURCE_FILE_AT_LINE (706)).operator_concat (GALGAS_string ("' label gets ") COMMA_SOURCE_FILE_AT_LINE (707)).operator_concat (ioArgument_ioAddress.reader_hexString (SOURCE_FILE_AT_LINE (707)) COMMA_SOURCE_FILE_AT_LINE (707)).operator_concat (GALGAS_string (" value in second pass, while it gets ") COMMA_SOURCE_FILE_AT_LINE (707)).operator_concat (var_targetAddress.reader_hexString (SOURCE_FILE_AT_LINE (708)) COMMA_SOURCE_FILE_AT_LINE (708)).operator_concat (GALGAS_string (" in first pass") COMMA_SOURCE_FILE_AT_LINE (708)) COMMA_SOURCE_FILE_AT_LINE (706)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLRD generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD) ;
  if (object->mAttribute_mOption.isValid ()) {
    switch (object->mAttribute_mOption.enumValue ()) {
    case GALGAS_tableAccessOption::kNotBuilt:
      break ;
    case GALGAS_tableAccessOption::kEnum_simpleAccess: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 8U) COMMA_SOURCE_FILE_AT_LINE (720)) COMMA_SOURCE_FILE_AT_LINE (720)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_postIncrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 9U) COMMA_SOURCE_FILE_AT_LINE (721)) COMMA_SOURCE_FILE_AT_LINE (721)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_postDecrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 10U) COMMA_SOURCE_FILE_AT_LINE (722)) COMMA_SOURCE_FILE_AT_LINE (722)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_preIncrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 11U) COMMA_SOURCE_FILE_AT_LINE (723)) COMMA_SOURCE_FILE_AT_LINE (723)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLWT generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                            GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
  if (object->mAttribute_mOption.isValid ()) {
    switch (object->mAttribute_mOption.enumValue ()) {
    case GALGAS_tableAccessOption::kNotBuilt:
      break ;
    case GALGAS_tableAccessOption::kEnum_simpleAccess: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 12U) COMMA_SOURCE_FILE_AT_LINE (735)) COMMA_SOURCE_FILE_AT_LINE (735)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_postIncrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 13U) COMMA_SOURCE_FILE_AT_LINE (736)) COMMA_SOURCE_FILE_AT_LINE (736)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_postDecrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 14U) COMMA_SOURCE_FILE_AT_LINE (737)) COMMA_SOURCE_FILE_AT_LINE (737)) ;
      } break ;
    case GALGAS_tableAccessOption::kEnum_preIncrement: {
      ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 15U) COMMA_SOURCE_FILE_AT_LINE (738)) COMMA_SOURCE_FILE_AT_LINE (738)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MNOP generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                           const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable /* constinArgument_inRoutineSymbolTable */,
                                                                                                           GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                           GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                           C_Compiler * inCompiler
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (749)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_location location_1 (object->mAttribute_mOccurrenceFactor.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticWarning (location_1, GALGAS_string ("No generated code") COMMA_SOURCE_FILE_AT_LINE (750)) ;
  }
  GALGAS_uint var_idx = GALGAS_uint ((PMUInt32) 0U) ;
  if (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (753)).isValid ()) {
    PMUInt32 variant_25386 = object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (753)).uintValue () ;
    bool loop_25386 = true ;
    while (loop_25386) {
      loop_25386 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (754)))).isValid () ;
      if (loop_25386) {
        loop_25386 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (754)))).boolValue () ;
      }
      if (loop_25386 && (0 == variant_25386)) {
        loop_25386 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (753)) ;
      }
      if (loop_25386) {
        variant_25386 -- ;
        ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 0U) COMMA_SOURCE_FILE_AT_LINE (756)) COMMA_SOURCE_FILE_AT_LINE (756)) ;
        var_idx.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (757)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

