pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                        GALGAS_uint & ioArgument_ioAddress,
                                                                                                                        GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                        C_Compiler * inCompiler
                                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  GALGAS_uint var_targetAddress ;
  GALGAS_lstring var_target = GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_2"), object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (769)) ;
  constinArgument_inRoutineSymbolTable.method_searchKey (var_target, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (770)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    routine_emitRCALLinstruction (ioArgument_ioAddress, var_targetAddress, var_target, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (772)) ;
    }
  }else if (kBoolFalse == test_0) {
    {
    routine_emit_5F_pic_31__38__5F_CALLinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (774)) ;
    }
  }
  cEnumerator_uintlist enumerator_26171 (object->mAttribute_mLiteralValues, kEnumeration_up) ;
  while (enumerator_26171.hasCurrentObject ()) {
    ioArgument_ioCode.addAssign_operation (GALGAS_uintlist::constructor_listWithValue (GALGAS_uint ((PMUInt32) 3072U).operator_or (enumerator_26171.current_mValue (HERE) COMMA_SOURCE_FILE_AT_LINE (777)) COMMA_SOURCE_FILE_AT_LINE (777)) COMMA_SOURCE_FILE_AT_LINE (777)) ;
    enumerator_26171.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                      const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                      GALGAS_uint & ioArgument_ioAddress,
                                                                                                                      GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                      C_Compiler * inCompiler
                                                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  GALGAS_lstring var_target = GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_2"), object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (788)) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (var_target, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (790)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    routine_emitRCALLinstruction (ioArgument_ioAddress, var_targetAddress, var_target, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (792)) ;
    }
  }else if (kBoolFalse == test_0) {
    {
    routine_emit_5F_pic_31__38__5F_CALLinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (794)) ;
    }
  }
  GALGAS_uint var_addressForComputingBRA = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (797)) ;
  const enumGalgasBool test_1 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (798)).boolEnum () ;
  if (kBoolTrue == test_1) {
    var_addressForComputingBRA = var_addressForComputingBRA.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (799)) ;
  }
  cEnumerator_lstringlist enumerator_27062 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_27062.hasCurrentObject ()) {
    constinArgument_inRoutineSymbolTable.method_searchKey (enumerator_27062.current_mValue (HERE), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (803)) ;
    {
    routine_emitBRAinstruction (var_addressForComputingBRA, var_targetAddress, enumerator_27062.current_mValue (HERE).reader_location (SOURCE_FILE_AT_LINE (807)), ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (804)) ;
    }
    var_addressForComputingBRA = var_addressForComputingBRA.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (810)) ;
    enumerator_27062.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

