pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                       const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                       GALGAS_uint & ioArgument_ioAddress,
                                                                                                                       GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                       C_Compiler * inCompiler
                                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  GALGAS_lstring var_target = GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_4"), object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (821)) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (var_target, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (823)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    routine_emitRCALLinstruction (ioArgument_ioAddress, var_targetAddress, var_target, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (825)) ;
    }
  }else if (kBoolFalse == test_0) {
    {
    routine_emit_5F_pic_31__38__5F_CALLinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (827)) ;
    }
  }
  cEnumerator_lstringlist enumerator_27953 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_27953.hasCurrentObject ()) {
    constinArgument_inRoutineSymbolTable.method_searchKey (enumerator_27953.current_mValue (HERE), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (830)) ;
    {
    routine_emit_5F_pic_31__38__5F_GOTOinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (831)) ;
    }
    enumerator_27953.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument_inRoutineSymbolTable,
                                                                                                                        GALGAS_uint & ioArgument_ioAddress,
                                                                                                                        GALGAS_emittedCodeList & ioArgument_ioCode,
                                                                                                                        C_Compiler * inCompiler
                                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  GALGAS_lstring var_target = GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_4"), object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (845)) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (var_target, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (847)) ;
  GALGAS_uint var_currentInstructionAddress ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    {
    routine_emitRCALLinstruction (ioArgument_ioAddress, var_targetAddress, var_target, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (850)) ;
    }
    var_currentInstructionAddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (851)) ;
  }else if (kBoolFalse == test_0) {
    {
    routine_emit_5F_pic_31__38__5F_CALLinstruction (var_targetAddress, ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (853)) ;
    }
    var_currentInstructionAddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (854)) ;
  }
  GALGAS_uint var_nextInstructionAddress = var_currentInstructionAddress.add_operation (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (856)).multiply_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (856)), inCompiler COMMA_SOURCE_FILE_AT_LINE (856)).substract_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (856)) ;
  GALGAS_uint var_idx = GALGAS_uint ((PMUInt32) 0U) ;
  cEnumerator_lstringlist enumerator_28987 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_28987.hasCurrentObject ()) {
    var_idx.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (859)) ;
    constinArgument_inRoutineSymbolTable.method_searchKey (enumerator_28987.current_mValue (HERE), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (860)) ;
    {
    routine_emitRCALLinstruction (var_currentInstructionAddress, var_targetAddress, enumerator_28987.current_mValue (HERE), ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (861)) ;
    }
    var_currentInstructionAddress = var_currentInstructionAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (862)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictInf, var_idx.objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (863)))).boolEnum () ;
    if (kBoolTrue == test_1) {
      {
      routine_emitBRAinstruction (var_currentInstructionAddress, var_nextInstructionAddress, enumerator_28987.current_mValue (HERE).reader_location (SOURCE_FILE_AT_LINE (864)), ioArgument_ioCode, inCompiler COMMA_SOURCE_FILE_AT_LINE (864)) ;
      }
      var_currentInstructionAddress = var_currentInstructionAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (865)) ;
    }
    enumerator_28987.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

