pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_generateBinaryCodeAtAddress (void) {
  enterCategoryMethod_generateBinaryCodeAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_generateBinaryCodeAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_generateBinaryCodeAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_generateBinaryCodeAtAddress, NULL) ;

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (void) :
mAttribute_lkey (),
mAttribute_mSymbolAddress () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::~ GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (const GALGAS_lstring & inOperand0,
                                                                                                                            const GALGAS_uint & inOperand1) :
mAttribute_lkey (inOperand0),
mAttribute_mSymbolAddress (inOperand1) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (GALGAS_lstring::constructor_default (HERE),
                                                                       GALGAS_uint::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                                                            const GALGAS_uint & inOperand1 
                                                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid ()) {
    result = GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (inOperand0, inOperand1) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mSymbolAddress.objectCompare (inOperand.mAttribute_mSymbolAddress) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mSymbolAddress.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mSymbolAddress.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::description (C_String & ioString,
                                                                                const PMSInt32 inIndentation) const {
  ioString << "<struct @pic18_intermediate_symbolTable.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mSymbolAddress.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::reader_mSymbolAddress (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mSymbolAddress ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//               @pic18_intermediate_symbolTable.element type                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element ("pic18_intermediate_symbolTable.element",
                                                                              NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                                                                          C_Compiler * inCompiler,
                                                                                                                                          const GALGAS_location & inErrorLocation,
                                                                                                                                          const GALGAS_string & inErrorMessage
                                                                                                                                          COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element * p = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

