pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.cpp
GALGAS_emittedCodeList_2E_element::GALGAS_emittedCodeList_2E_element (void) :
mAttribute_mCode () {
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element::~ GALGAS_emittedCodeList_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element::GALGAS_emittedCodeList_2E_element (const GALGAS_uintlist & inOperand0) :
mAttribute_mCode (inOperand0) {
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element GALGAS_emittedCodeList_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_emittedCodeList_2E_element (GALGAS_uintlist::constructor_emptyList (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element GALGAS_emittedCodeList_2E_element::constructor_new (const GALGAS_uintlist & inOperand0 
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_emittedCodeList_2E_element result ;
  if (inOperand0.isValid ()) {
    result = GALGAS_emittedCodeList_2E_element (inOperand0) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_emittedCodeList_2E_element::objectCompare (const GALGAS_emittedCodeList_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_mCode.objectCompare (inOperand.mAttribute_mCode) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_emittedCodeList_2E_element::isValid (void) const {
  return mAttribute_mCode.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList_2E_element::drop (void) {
  mAttribute_mCode.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_emittedCodeList_2E_element::description (C_String & ioString,
                                                     const PMSInt32 inIndentation) const {
  ioString << "<struct @emittedCodeList.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_mCode.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_uintlist GALGAS_emittedCodeList_2E_element::reader_mCode (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mCode ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                       @emittedCodeList.element type                       *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_emittedCodeList_2E_element ("emittedCodeList.element",
                                                   NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_emittedCodeList_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_emittedCodeList_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_emittedCodeList_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_emittedCodeList_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_emittedCodeList_2E_element GALGAS_emittedCodeList_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                    C_Compiler * inCompiler,
                                                                                    const GALGAS_location & inErrorLocation,
                                                                                    const GALGAS_string & inErrorMessage
                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_emittedCodeList_2E_element result ;
  const GALGAS_emittedCodeList_2E_element * p = (const GALGAS_emittedCodeList_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_emittedCodeList_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->emitSemanticError (inErrorLocation, inErrorMessage COMMA_THERE) ;
    }  
  }
  return result ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


